In [1]:
import pandas as pd
df = pd.read_csv('data/survey_results_public.csv')
schema_df = pd.read_csv('data/survey_results_schema.csv')
people = {
    "first" : ["Corey", "Jane", "John"],
    "last" : ["Schafer", "Doe", "Doe"],
    "email" : ["CoreyMSchafer@gmail.com", "JaneDoe@email.com","JohnDoe@email.com"]
}
df1 = pd.DataFrame(people)

In [2]:
df1

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [3]:
df1['full_name'] = df1['first'] +' '+df1['last']

In [4]:
df1

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [5]:
df1.drop(['first','last'], axis=1)

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [6]:
df1

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [7]:
df1.drop(columns=['first','last'], inplace=True)

In [8]:
df1

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [9]:
# df.drop(columns=['',''], inplace=True)
# expand

In [27]:
df1['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe
3    NaN      NaN

In [11]:
df1[['first','last']] = df1['full_name'].str.split(' ', expand=True)

In [12]:
df1

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [13]:
# adding rows to data frames using append(dictionary)

In [14]:
df1.append({'first':'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [15]:
people = {
    "first" : ["Tony", "Steve"],
    "last" : ["Stark", "Rogers"],
    "email" : ["IronMan@avenge.com", "Cap@avenge.com"]
}

In [16]:
df2 = pd.DataFrame(people)

In [17]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [31]:
df1 = df1.append(df2, ignore_index=True, sort=False)

In [32]:
df1

                      email  first      full_name     last
0   CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1         JaneDoe@email.com   Jane       Jane Doe      Doe
2         JohnDoe@email.com   John       John Doe      Doe
3        IronMan@avenge.com   Tony            NaN    Stark
4        IronMan@avenge.com   Tony            NaN    Stark
5            Cap@avenge.com  Steve            NaN   Rogers
6        IronMan@avenge.com   Tony            NaN    Stark
7            Cap@avenge.com  Steve            NaN   Rogers
8        IronMan@avenge.com   Tony            NaN    Stark
9            Cap@avenge.com  Steve            NaN   Rogers
10       IronMan@avenge.com   Tony            NaN    Stark
11           Cap@avenge.com  Steve            NaN   Rogers

In [20]:
# removing rows

In [21]:
df1.drop(index=4, inplace=True)

In [22]:
df1

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [23]:
filt = df1['last']=='Doe'

In [24]:
df1.drop(index=df1[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark

In [25]:
df1

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark